Failed to create basic layer geometry. Probably a failure either to create the cutter or to intersect the cutter with the wall geometry.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CouldNotCreateWallPart { get; }
  Visual Basic
Public Shared ReadOnly Property CouldNotCreateWallPart As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CouldNotCreateWallPart {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PartMakerMethodForWallFailures Class
  Autodesk.Revit.DB Namespace